//Task1
// alert ("Let's play!");
//Task2
// Вычислить результат 158+2 и вывести значение выражения в диалоговое окно.
// let a = 158;
// let b = 2;
// alert (a + b)
// Task3
// Передать строковый параметр в диалоговое окно. 
// Например, вывести «Привет, Алевтина!», где имя — это передаваемый параметр.
// let first_name = "Алевтина";
// alert (`Привет, ${first_name}!`)
// Task4
// Ввызвать диалоговое окно с заголовком «Как вас зовут?» и подсказкой «Имя» в поле ввода. 
// Затем вывести имя, которое ввели.
// let first_name = prompt('Name');
// alert (`Привет, ${first_name}!`)
// Task5 Написать функцию, выводящую в диалоговом окне текст и переменную. 
// Например, «Привет, Алевтина». Где «Алевтина» — это внешняя переменная.
// let first_name = 'Алевтина';
// function showMessage() {
//     let message = 'Привет, ' + first_name;
//     alert (message);
// }
// showMessage();
// Task6
// вывести на экран **** в диалоговом окне текст с 
// сообщением “Вы уверены?” и кнопками «ОК» , «Отмена».
// user_question = confirm('Вы уверены ?');
//Task7
// перепишите код, используя конструкцию switch-case, 
// запрашивая возраст пользователя через диалоговое окно.
//  <script>
// let age = parseInt(prompt('Введите ваш возраст'));

// if (age == 18) {
//     alert('Вы совершеннолетний, все можно!');}
// else if (age < 18){ 
//     alert('Вам надо учить уроки!');}
// else if (age > 18){ 
//     alert('Ложитесь спать, завтра на работу');}
// else {
//     alert('Мы не знаем что Вам делать');}

// {/* </script>  */}

// let user_age = parseInt(prompt('Введите ваш возраст'));

// switch(user_age) {
//     case user_age < 18:
//         alert( 'Уроки!' );
//         break;
//     case user_age > 18:
//         alert( 'На работу!' );
//         break;
//     default:
//         alert( 'Не знаю' );
//         break;
// }


